## Import pandas

In [1]:
import pandas as pd

## Create DataFrame

In [18]:
mydict = {
    "dev_id": ["001", "002", "003", "004", "005", "006"],
    "name": ["Thomas", "Lothar", "Andrew", "John", "Elon", "Steve"],
    "age": [36, 48, 21, 44, 18, 27],
    "salary": [60000, 90000, 50000, 120000, 90000, 110000],
    "country": ["Germany", "Germany", "United States", "Scotland", "United States", "United States"],
    "city": ["Berlin", "Munich", "Boston", "Edinburgh", "New York", "San Francisco"],
}

df_dev = pd.DataFrame(mydict)
df_dev.set_index("dev_id", inplace=True)
df_dev

          name  age  salary        country           city
dev_id
001     Thomas   36   60000        Germany         Berlin
002     Lothar   48   90000        Germany         Munich
003     Andrew   21   50000  United States         Boston
004       John   44  120000       Scotland      Edinburgh
005       Elon   18   90000  United States       New York
006      Steve   27  110000  United States  San Francisco

## Removing Columns

In [13]:
df_dev.drop(columns=['salary', 'city'], inplace=True)
df_dev

          name  age        country
dev_id
001     Thomas   36        Germany
002     Lothar   48        Germany
003     Andrew   21  United States
004       John   44       Scotland
005       Elon   18  United States
006      Steve   27  United States

## Removing Rows

In [19]:
df_dev.drop(index=['001', '004'], inplace=True)
df_dev

          name  age  salary        country           city
dev_id
002     Lothar   48   90000        Germany         Munich
003     Andrew   21   50000  United States         Boston
005       Elon   18   90000  United States       New York
006      Steve   27  110000  United States  San Francisco